init-org.org
*** ChangeLog:
    - 2016 12 16 init SeJ
    - 2016 12 21 add kill-this-buffer
    - 2017 01 06 cleanup by move of packages to init-misc-pkgs.el
    - 2017 01 06 change from req-package to use-package
    - 2017 01 11 add more pragmatic Emacs tips
    - 2017 01 12 add steve drunken tips
    - 2017 01 30 add sudo-edit function (C-x C-r) to edit file as sudo
    - 2017 03 29 add truncate lines setting
    - 2017 05 09 add copy-line C-c C-k
    -        add some neat keybindings from emacs-starter-kit
    -        rename file to init-bindings-settings.el
    - 2017 05 12 adds from purcell/emacs.d
    - 2017 05 21 add delete to trash can
    - 2017 05 25 add imenu binding
    - 2017 05 30 hippie-expand remap M-/ C-M-/
    - 2017 06 05 add sej-map keyboard mapping
    - 2017 08 07 add Hyper & Super keys for osx and win remove sej-map
    - 2017 08 21 add some Lisp stuff from Getting Started with Emacs Lisp
    - 2017 08 29 take another run at sej-map
    - 2017 09 08 add code to unset C- M- digit keys
    - 2017 09 18 add goto-line with temp line numbers
    - 2017 09 19 add transpose keybindings & others from magnar
    - 2017 09 20 make more pure keybindings & move others stuff out
    - 2017 12 21 edits move movement bindings into init-movement
    - 2018 03 19 some cleanup & mods
    - 2018 04 30 global mark and cua-copy-to-global-mark and cua-cut-to-global-mark
    - 2018 06 22 remove H-o for org mode to make room for hl-todo-occur
    - 2018 08 06 H-a from counsel-ag to helm-ag
    - 2018 08 07 re-institute winner-mode std keybindings
    -            replace avy with ace-jump-mode
    -            M-o for ace-window
    -            M-u for string-inflection
    -            added simpleclip for better clipboard integration
    - 2018 09 24 changed RET behaviour to add newline-and-indent
    - 2018 09 26 change modifier keys for mac used in conjuction with karabiner & mac settings
    - 2018 09 28 back to avy; add anzu for query replace
    - 2018 10 02 PC keyboard modifer set-up
    - 2018 10 04 comment out cua global mark mode as not often used
    -            use Alt for some special characters

** Set OS specific modifiers
*** MAC OS Apple keyboard
    - caps lock is control (through karabiner)
      Fn key do Hyper
      LControl key do RControl (karabiner) which is Super (emacs)
      left opt/alt key do emacs Alt modifier
      right opt/alt key do regular alt key
      left and right command(apple) key do Meta
      karabiner.json backup files in dotfiles under .config directory
    #+BEGIN_SRC emacs-lisp
      (cond
       (sys/macp ; OSX
        (progn
          (message "Mac OSX")
          (if (boundp 'mac-carbon-version-string) ;; using mac-port?
              ( progn
                ;; for emacs-mac-port
                (setq mac-right-command-modifier 'none)
                (setq mac-right-option-modifier 'none)
                (setq mac-function-modifier 'hyper)
                (setq mac-control-modifier 'control)
                (setq mac-right-control-modifier 'super)
                (setq mac-option-modifier 'alt)
                (setq mac-command-modifier 'meta))
            ( progn
              ;; for regular Emacs port
              (setq ns-right-command-modifier 'none)
              (setq ns-right-option-modifier 'none)
              (setq ns-function-modifier 'hyper)
              (setq ns-control-modifier 'control)
              (setq ns-right-control-modifier 'super)
              (setq ns-option-modifier 'alt)
              (setq ns-command-modifier 'meta)
              )))))
    #+END_SRC

*** PC keyboard
    - CapsLock::LControl through AutoHotkeys
      scroll lock do hyper (tab to scroll lock using AutoHotkeys)
      Left control key do super (LControl::Appskey using AutoHotkeys)
      Left Windows left alone due to win10 taking many keys
      LAlt::Meta
      RAlt::Alt modifier (RAlt::NumLock using Autohotkeys) **only works as tap & release
      Rwin is Alt (not used in current laptop)
      NOTE: only negative of this set-up is RAlt as numlock -> Alt is awkward push & release
    #+BEGIN_SRC emacs-lisp
      (cond
       (sys/win32p ; Microsoft Windows
        (progn
          (message "Microsoft Windows")
          (setq w32-pass-lwindow-to-system t
                w32-recognize-altgr nil
                W32-enable-caps-lock nil
                w32-pass-rwindow-to-system nil
                w32-rwindow-modifier 'meta
                w32-apps-modifier 'super
                w32-pass-alt-to-system t
                w32-alt-is-meta t
                w32-scroll-lock-modifier 'hyper
                w32-enable-num-lock nil)
          (w32-register-hot-key [A-])
          (define-key function-key-map (kbd "<kp-numlock>") 'event-apply-alt-modifier)
          )))
    #+END_SRC

*** Linux keyboard
    - nothing set at this moment
    #+BEGIN_SRC emacs-lisp
      (cond
       (sys/linuxp ; linux
        (progn
          (message "Linux")
          ;; load-dir init.d
          )))
    #+END_SRC

** sej-mode & map set-up
   - Below is taken from stackexchange (Emacs)
     Main use is to have my key bindings have the highest priority
   https://github.com/kaushalmodi/.emacs.d/blob/master/elisp/modi-mode.el
   #+BEGIN_SRC emacs-lisp
     (defvar sej-mode-map (make-sparse-keymap)
       "Keymap for 'sej-mode'.")

       ;;;###autoload
     (define-minor-mode sej-mode
       "A minor mode so that my key settings override annoying major modes."
       ;; If init-value is not set to t, this mode does not get enabled in
       ;; `fundamental-mode' buffers even after doing \"(global-my-mode 1)\".
       ;; More info: http://emacs.stackexchange.com/q/16693/115
       :init-value t
       :lighter " sej"
       :keymap sej-mode-map)

       ;;;###autoload
     (define-globalized-minor-mode global-sej-mode sej-mode sej-mode)

     ;; https://github.com/jwiegley/use-package/blob/master/bind-key.el
     ;; The keymaps in `emulation-mode-map-alists' take precedence over
     ;; `minor-mode-map-alist'
     (add-to-list 'emulation-mode-map-alists `((sej-mode . ,sej-mode-map)))

     ;; Turn off the minor mode in the minibuffer
     (defun turn-off-sej-mode ()
       "Turn off sej-mode."
       (sej-mode -1))
     (add-hook 'minibuffer-setup-hook #'turn-off-sej-mode)

     (defmacro bind-to-sej-map (key fn)
       "Bind to KEY (as FN) a function to the `sej-mode-map'.
       USAGE: (bind-to-sej-map \"f\" #'full-screen-center)."
       `(define-key sej-mode-map (kbd ,key) ,fn))

     ;; http://emacs.stackexchange.com/a/12906/115
     (defun unbind-from-sej-map (key)
       "Unbind from KEY the function from the 'sej-mode-map'.
       USAGE: (unbind-from-modi-map \"key f\")."
       (interactive "kUnset key from sej-mode-map: ")
       (define-key sej-mode-map (kbd (key-description key)) nil)
       (message "%s" (format "Unbound %s key from the %s."
                             (propertize (key-description key)
                                         'face 'font-lock-function-name-face)
                             (propertize "sej-mode-map"
                                         'face 'font-lock-function-name-face))))
     ;; Minor mode tutorial: http://nullprogram.com/blog/2013/02/06/
   #+END_SRC

** shorthand for interactive lambdas
   #+BEGIN_SRC emacs-lisp
     (defmacro λ (&rest body)
       "Shorthand for interactive lambdas (BODY)."
       `(lambda ()
          (interactive)
          ,@body))
   #+END_SRC

** keybindings
*** global keybindings
**** general items
     #+BEGIN_SRC emacs-lisp
       (global-set-key (kbd "RET") 'newline-and-indent)

       ;; unset C- and M- digit keys
       (dotimes (n 10)
         (global-unset-key (kbd (format "C-%d" n)))
         (global-unset-key (kbd (format "M-%d" n)))
         )
     #+END_SRC

**** special character definitions
     - Neat bindings for C-x 8 ; put some Alt bindins there for fun as well
     #+BEGIN_SRC emacs-lisp
       (global-set-key (kbd "C-x 8 l") (λ (insert "\u03bb")))
       (global-set-key (kbd "A-L") (λ (insert "\u03bb")))
       (global-set-key (kbd "C-x 8 t m") (λ (insert "™")))
       (global-set-key (kbd "A-T") (λ (insert "™")))
       (global-set-key (kbd "C-x 8 C") (λ (insert "©")))
       (global-set-key (kbd "A-C") (λ (insert "©")))
       (global-set-key (kbd "C-x 8 >") (λ (insert "→")))
       (global-set-key (kbd "A->") (λ (insert "→")))
       (global-set-key (kbd "C-x 8 8") (λ (insert "∞")))
       (global-set-key (kbd "A-8") (λ (insert "∞")))
       (global-set-key (kbd "C-x 8 v") (λ (insert "✓")))
       (global-set-key (kbd "A-V") (λ (insert "✓")))
     #+END_SRC

**** transpose global
     - Transpose stuff with M-t
     #+BEGIN_SRC emacs-lisp
       (global-unset-key (kbd "M-t")) ;; which used to be transpose-words
       (global-set-key (kbd "M-t l") 'transpose-lines)
       (global-set-key (kbd "M-t w") 'transpose-words)
       (global-set-key (kbd "M-t s") 'transpose-sexps)
       (global-set-key (kbd "M-t p") 'transpose-params)
     #+END_SRC

*** sej-mode-map bindings
**** general sej-mode-map bindings
     #+BEGIN_SRC emacs-lisp
       (define-key global-map (kbd "C-h C-h") nil)
       (define-key sej-mode-map (kbd "C-h C-h") nil)

       (define-key sej-mode-map (kbd "M-'") 'next-multiframe-window)
       (define-key sej-mode-map (kbd "C-j") 'newline-and-indent)
       (define-key sej-mode-map (kbd "C-;") 'comment-dwim-2) ; defined in init-misc-packages
       (define-key sej-mode-map (kbd "M-/") 'hippie-expand)
       (define-key sej-mode-map (kbd "M-j") (lambda () (interactive) (join-line -1)))
       (define-key sej-mode-map (kbd "C-s") 'swiper-isearch)

       (define-key sej-mode-map (kbd "C-+") 'text-scale-increase)
       (define-key sej-mode-map (kbd "C--") 'text-scale-decrease)
       (define-key sej-mode-map (kbd "C-x g") 'magit-status)

       ;;added tips from pragmatic emacs
       (define-key sej-mode-map (kbd "C-x k") 'kill-this-buffer)
       (define-key sej-mode-map (kbd "C-x w") 'delete-frame)

       ;; Zap to char
       (define-key sej-mode-map (kbd "M-z") 'zap-to-char)
       (define-key sej-mode-map (kbd "s-z") (lambda (char) (interactive "cZap to char backwards: ") (zap-to-char -1 char))) ;
       (define-key sej-mode-map (kbd "C-M-d") 'backward-kill-word)

       ;;scroll window up/down by one line
       (define-key sej-mode-map (kbd "A-n") (lambda () (interactive) (scroll-up 1)))
       (define-key sej-mode-map (kbd "A-p") (lambda () (interactive) (scroll-down 1)))
       (define-key sej-mode-map (kbd "A-SPC") 'cycle-spacing)

       ;;added tips from steve drunken blog 10 specific ways to improve productivity
       (define-key sej-mode-map (kbd "C-x C-m") 'execute-extended-command)
       (define-key sej-mode-map (kbd "C-c C-m") 'execute-extended-command)

       ;; Align your code in a pretty way.
       (define-key sej-mode-map (kbd "C-x \\") 'align-regexp)

       ;; push and jump to mark functions
       ;; (defined in init-misc-defuns.el)
       (define-key sej-mode-map (kbd "C-`") 'sej/push-mark-no-activate)
       (define-key sej-mode-map (kbd "M-`") 'sej/jump-to-mark)

       ;; function to edit the curent file as root
       ;; (defined in init-misc-defuns.el)
       (define-key sej-mode-map (kbd "C-c C-s") 'sej/sudo-edit)

       ;; number lines with rectangle defined in init-writing.el
       (define-key sej-mode-map (kbd "C-x r N") 'number-rectangle)

       ;; line numbers when using goto-line M-g M-g or M-g g
       ;; (defined in init-misc-defuns.el)
       (global-set-key [remap goto-line] 'goto-line-preview)
     #+END_SRC


